name: "yolov10m"
platform: "tensorrt_plan"
max_batch_size: 1

input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [3,640,640]
  }
]

output [
  {
    name: "output0"
    data_type: TYPE_FP32
    dims: [300, 6]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [0]
  }
]
